<template>
  <view class="agreement">
    <view class="card">
      <view class="head">
        <view class="title">协议及隐私政策</view>
      </view>
      <view class="centent">
        <view class="text"
          >长沙星兴万物科技有限公司隐私政策
           长沙星兴万物科技有限公司平台的所有权和运营权归长沙星兴万物科技有限公司所有；
          本站（“长沙星兴万物科技有限公司”）深知个人信息对您的重要性，长沙星兴万物科技有限公司尊重并保护所有使用长沙星兴万物科技有限公司服务的用户的个人信息，并会尽全力保护您的个人信息安全可靠。长沙星兴万物科技有限公司致力于维持您对长沙星兴万物科技有限公司的信任，恪守以下原则，保护您的个人信息：权责一致原则、目的明确原则、选择同意原则、最少够用原则、确保安全原则、主体参与原则、公开透明原则等。同时，长沙星兴万物科技有限公司承诺，长沙星兴万物科技有限公司将按业界成熟的安全标准，采取相应的安全保护措施来保护您的个人信息。请在使用长沙星兴万物科技有限公司的产品（或服务）前，仔细阅读并了解本《长沙星兴万物科技有限公司隐私政策》（下称“本隐私政策”）。
          一、长沙星兴万物科技有限公司处理个人信息的法律依据
          本隐私政策制定的法律依据为《中华人民共和国消费者权益保护法》、《中华人民共和国网络安全法》、《中华人民共和国电子商务法》、《信息安全技术个人信息安全规范》以及其他涉及公民个人信息的相关法律法规。通常，长沙星兴万物科技有限公司会基于本隐私政策提示的功能收集您的个人信息。某些情况下，如果涉及其他信息的收集长沙星兴万物科技有限公司会单独向您出示个人信息保护说明条款。
          二、本隐私政策的适用范围
          本隐私政策适用于您使用本平台的产品或服务时使用。
          三、长沙星兴万物科技有限公司如何收集和使用您的个人信息
          个人信息是指以电子或者其他方式记录的能够单独或者与其他信息结合识别特定自然人身份或者反映特定自然人活动情况的各种信息。
          个人敏感信息是指一旦泄露、非法提供或滥用可能危害人身和财产安全，极易导致个人名誉、身心健康受到损害或歧视性待遇等的个人信息。本隐私政策涉及到的个人敏感信息长沙星兴万物科技有限公司将加粗并加下划线的方式提示您注意阅读。在您向长沙星兴万物科技有限公司提供任何属于敏感信息的个人信息前，请您清楚考虑该等提供是恰当的并且同意您的个人敏感信息可按本隐私政策所述的目的和方式进行处理。长沙星兴万物科技有限公司会在得到您的同意后收集和使用您的敏感信息以实现与长沙星兴万物科技有限公司业务相关的功能，并允许您对这些敏感信息的收集与使用做出不同意的选择，但是拒绝使用这些信息会影响您使用相关功能。
          原则上，长沙星兴万物科技有限公司仅会出于本隐私政策所述的以下目的，收集和使用您的个人信息。
          （一）帮助您成为长沙星兴万物科技有限公司的注册登录用户
          您自行注册成为长沙星兴万物科技有限公司的用户 （二）客户服务
          当您向长沙星兴万物科技有限公司申诉或进行咨询时，为了方便与您联系或帮助您解决问题，长沙星兴万物科技有限公司可能需要您提供姓名、手机号码、电子邮件信息。如您拒绝提供上述信息，可能部分功能无法使用，同时无法向您及时反馈申诉或咨询结果。
          （三）征得授权同意的例外
          根据相关法律法规的规定，在以下情形中，长沙星兴万物科技有限公司可以在不征得您的授权同意的情况下收集、使用一些必要的个人信息：
          1、与公共安全、公共卫生、重大公共利益直接相关的；
          2、出于维护您或其他个人的生命、财产等重大合法权益但又很难得到本人同意的；
          3、从合法公开披露的信息中收集到您的个人信息，如从合法的新闻报道、政府信息公开等渠道；
          4、根据您的要求签订和履行合同所必需的； 5、法律法规规定的其他情形。
          四、长沙星兴万物科技有限公司如何保护您的个人信息
          为保障您的信息安全，长沙星兴万物科技有限公司努力采取各种合理的物理、电子和管理方面的安全措施来保护您的信息，使您的信息不会被泄漏、毁损或者丢失，包括但不限于SSL、信息加密存储、数据中心的访问控制。
          1、身份鉴别：长沙星兴万物科技有限公司通过微信扫码授权，进行用户身份合法性鉴别，防止非经授权的介入；
          2、账号保护：您的账户均有安全保护功能，请妥善保管您的账户及密码信息。对用户密码进行加密等安全措施确保您的信息不丢失，不被滥用和变造。尽管有前述安全措施，但同时也请您理解，由于技术的限制以及可能存在的各种恶意手段，即便竭尽所能加强安全措施，在信息网络上也不存在“完善的安全措施”。
          3、互联网环境并非百分之百安全，长沙星兴万物科技有限公司将尽力确保或担保您发送给长沙星兴万物科技有限公司的任何信息的安全性。在不幸发生个人信息安全事件后，长沙星兴万物科技有限公司将按照法律法规的要求，及时向您告知：安全事件的基本情况和可能的影响、长沙星兴万物科技有限公司已采取或将要采取的处置措施、您可自主防范和降低风险的建议、对您的补救措施等。长沙星兴万物科技有限公司将及时将事件相关情况以邮件、电话、推送通知等方式告知您，难以逐一告知个人信息主体时，长沙星兴万物科技有限公司会采取合理、有效的方式发布公告。
          五、长沙星兴万物科技有限公司如何处理未成年人的个人信息
          1、长沙星兴万物科技有限公司主要为组局信息发布平台，长沙星兴万物科技有限公司的服务主要面向成年人（原则上18周岁以上为成年人，16周岁以上且以自己的劳动收入为主要生活来源的亦视为成年人）。若您是未成年人，在使用长沙星兴万物科技有限公司的产品和/或服务前，您应在监护人的陪同下阅读本隐私政策，并应确保已征得您的监护人同意后使用长沙星兴万物科技有限公司的服务并向长沙星兴万物科技有限公司提供您的信息。 长沙星兴万物科技有限公司会根据国家相关法律法规的规定着重保护未成年人的个人信息。
          2、如您的监护人不同意您按照本隐私政策使用长沙星兴万物科技有限公司的服务或向长沙星兴万物科技有限公司提供信息，请您立即终止使用长沙星兴万物科技有限公司的服务并及时通知长沙星兴万物科技有限公司。
          3、对于经父母或法定监护人同意而收集未成年人个人信息的情况，长沙星兴万物科技有限公司只会在受到法律允许、父母或监护人明确同意或者保护未成年人所必要的情况下使用或公开披露此信息。
          4、若您是未成年人的监护人，当您对您所监护的未成年人使用长沙星兴万物科技有限公司的服务或其向长沙星兴万物科技有限公司提供的用户信息有任何疑问时，请您及时与长沙星兴万物科技有限公司联系。长沙星兴万物科技有限公司将根据国家相关法律法规及本隐私政策的规定保护未成年人用户信息的保密性及安全性。如果长沙星兴万物科技有限公司发现自己在未事先获得可证实的父母或法定监护人同意的情况下收集了未成年人的个人信息，则会设法尽快删除相关数据。
          六、本隐私政策的更新和通知
          长沙星兴万物科技有限公司的隐私政策可能变更。未经您明确同意，长沙星兴万物科技有限公司不会削减您按照本隐私政策所应享有的权利。长沙星兴万物科技有限公司会在本页面上发布对本隐私政策所做的任何变更。
          对于重大变更，长沙星兴万物科技有限公司还会提供更为显著的通知（包括对于某些服务， 长沙星兴万物科技有限公司会通过电子邮件发送通知，说明隐私政策的具体变更内容）。
          本隐私政策所指的重大变更包括但不限于：
          1、长沙星兴万物科技有限公司的服务模式发生重大变化。如处理个人信息的目的、处理的个人信息类型、个人信息的使用方式等；
          2、长沙星兴万物科技有限公司在所有权结构、组织架构等方面发生重大变化。如业务调整、破产并购等引起的所有者变更等；
          3、个人信息共享、转让或公开披露的主要对象发生变化；
          4、您参与个人信息处理方面的权利及其行使方式发生重大变化；
          5、长沙星兴万物科技有限公司负责处理个人信息安全的责任部门、联络方式及投诉渠道发生变化时；
        </view>
      </view>
      <view class="footer">
        <button @click="close">知道了</button>
      </view>
    </view>
  </view>
</template>

<script>
export default {
  methods: {
    close() {
      this.$emit("close");
    },
  },
};
</script>

<style lang="scss">
.agreement {
  width: 100%;
  height: 100vh;
  .card {
    background-color: #fff;
    border-radius: 16upx;
    height: 1000upx;
    overflow: hidden;
    position: absolute;
    top: 50%;
    margin: 0 40upx;
    padding: 0 30upx;
    transform: translateY(-50%);
    display: flex;
    flex-direction: column;
    .head {
      padding: 60upx 0 34upx 0;
      margin: 0 auto;
      font-size: 40upx;
      font-weight: 500;
      color: #000000;
      line-height: 56upx;
    }
    .centent {
      overflow: auto;
      font-size: 28upx;
      font-weight: 400;
      color: #666666;
      line-height: 40upx;
    }
    .text {
      white-space: break-spaces;
    }
    .footer {
      width: 100%;
      padding: 34upx 0 52upx 0;
      text-align: center;
      button {
        display: inline-block;
        background: #fff;
        padding: 20upx 50upx;
        border: 2upx solid #000;
        border-radius: 50upx;
        margin: 0 auto;
        font-size: 40upx;
        font-weight: 500;
        color: #000000;
        line-height: 56upx;
      }
    }
  }
}
</style>